program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3500.14.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.9.1"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios16>(tensor<fp16, [1, 1, 10, 32]> feat_erb_buf, tensor<fp16, [1, 1, 10, 96, 2]> feat_spec_buf, tensor<fp16, [1, 2, 256]> h_df_in, tensor<fp16, [1, 1, 256]> h_enc_in, tensor<fp16, [1, 2, 256]> h_erb_in, tensor<fp16, [1, 1, 10, 481, 2]> spec_buf) {
            tensor<int32, [1]> var_584_axes_0 = const()[name = tensor<string, []>("op_584_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 10, 96, 2]> var_584_cast_fp16 = squeeze(axes = var_584_axes_0, x = feat_spec_buf)[name = tensor<string, []>("op_584_cast_fp16")];
            tensor<int32, [4]> var_589 = const()[name = tensor<string, []>("op_589"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<int32, [8]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 2, 0, 0, 0])];
            tensor<string, []> input_1_mode_0 = const()[name = tensor<string, []>("input_1_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp16, []> const_0_to_fp16 = const()[name = tensor<string, []>("const_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 1, 12, 32]> input_1_cast_fp16 = pad(constant_val = const_0_to_fp16, mode = input_1_mode_0, pad = input_1_pad_0, x = feat_erb_buf)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<int32, [2]> input_3_strides_0 = const()[name = tensor<string, []>("input_3_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_3_dilations_0 = const()[name = tensor<string, []>("input_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_3_groups_0 = const()[name = tensor<string, []>("input_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 1, 3, 3]> const_27_to_fp16 = const()[name = tensor<string, []>("const_27_to_fp16"), val = tensor<fp16, [64, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [64]> const_28_to_fp16 = const()[name = tensor<string, []>("const_28_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1280)))];
            tensor<fp16, [1, 64, 10, 32]> input_5_cast_fp16 = conv(bias = const_28_to_fp16, dilations = input_3_dilations_0, groups = input_3_groups_0, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = input_3_strides_0, weight = const_27_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<fp16, [1, 64, 10, 32]> input_7_cast_fp16 = relu(x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<int32, [2]> input_9_strides_0 = const()[name = tensor<string, []>("input_9_strides_0"), val = tensor<int32, [2]>([1, 2])];
            tensor<int32, []> input_9_groups_0 = const()[name = tensor<string, []>("input_9_groups_0"), val = tensor<int32, []>(64)];
            tensor<int32, [2]> input_9_dilations_0 = const()[name = tensor<string, []>("input_9_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [64, 1, 1, 3]> original_enc_erb_conv1_0_weight_to_fp16 = const()[name = tensor<string, []>("original_enc_erb_conv1_0_weight_to_fp16"), val = tensor<fp16, [64, 1, 1, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1472)))];
            tensor<fp16, [1, 64, 10, 16]> input_9_cast_fp16 = conv(dilations = input_9_dilations_0, groups = input_9_groups_0, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = input_9_strides_0, weight = original_enc_erb_conv1_0_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<string, []> input_11_pad_type_0 = const()[name = tensor<string, []>("input_11_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_11_strides_0 = const()[name = tensor<string, []>("input_11_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_11_pad_0 = const()[name = tensor<string, []>("input_11_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_11_dilations_0 = const()[name = tensor<string, []>("input_11_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_11_groups_0 = const()[name = tensor<string, []>("input_11_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 1, 1]> const_29_to_fp16 = const()[name = tensor<string, []>("const_29_to_fp16"), val = tensor<fp16, [64, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1920)))];
            tensor<fp16, [64]> const_30_to_fp16 = const()[name = tensor<string, []>("const_30_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10176)))];
            tensor<fp16, [1, 64, 10, 16]> input_13_cast_fp16 = conv(bias = const_30_to_fp16, dilations = input_11_dilations_0, groups = input_11_groups_0, pad = input_11_pad_0, pad_type = input_11_pad_type_0, strides = input_11_strides_0, weight = const_29_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<fp16, [1, 64, 10, 16]> input_15_cast_fp16 = relu(x = input_13_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<string, []> input_17_pad_type_0 = const()[name = tensor<string, []>("input_17_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_17_pad_0 = const()[name = tensor<string, []>("input_17_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<int32, [2]> input_17_strides_0 = const()[name = tensor<string, []>("input_17_strides_0"), val = tensor<int32, [2]>([1, 2])];
            tensor<int32, []> input_17_groups_0 = const()[name = tensor<string, []>("input_17_groups_0"), val = tensor<int32, []>(64)];
            tensor<int32, [2]> input_17_dilations_0 = const()[name = tensor<string, []>("input_17_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [64, 1, 1, 3]> original_enc_erb_conv2_0_weight_to_fp16 = const()[name = tensor<string, []>("original_enc_erb_conv2_0_weight_to_fp16"), val = tensor<fp16, [64, 1, 1, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10368)))];
            tensor<fp16, [1, 64, 10, 8]> input_17_cast_fp16 = conv(dilations = input_17_dilations_0, groups = input_17_groups_0, pad = input_17_pad_0, pad_type = input_17_pad_type_0, strides = input_17_strides_0, weight = original_enc_erb_conv2_0_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<string, []> input_19_pad_type_0 = const()[name = tensor<string, []>("input_19_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_19_strides_0 = const()[name = tensor<string, []>("input_19_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_19_pad_0 = const()[name = tensor<string, []>("input_19_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_19_dilations_0 = const()[name = tensor<string, []>("input_19_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_19_groups_0 = const()[name = tensor<string, []>("input_19_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 1, 1]> const_31_to_fp16 = const()[name = tensor<string, []>("const_31_to_fp16"), val = tensor<fp16, [64, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10816)))];
            tensor<fp16, [64]> const_32_to_fp16 = const()[name = tensor<string, []>("const_32_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19072)))];
            tensor<fp16, [1, 64, 10, 8]> input_21_cast_fp16 = conv(bias = const_32_to_fp16, dilations = input_19_dilations_0, groups = input_19_groups_0, pad = input_19_pad_0, pad_type = input_19_pad_type_0, strides = input_19_strides_0, weight = const_31_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<fp16, [1, 64, 10, 8]> input_23_cast_fp16 = relu(x = input_21_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<string, []> input_25_pad_type_0 = const()[name = tensor<string, []>("input_25_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_25_pad_0 = const()[name = tensor<string, []>("input_25_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<int32, []> input_25_groups_0 = const()[name = tensor<string, []>("input_25_groups_0"), val = tensor<int32, []>(64)];
            tensor<int32, [2]> input_25_strides_0 = const()[name = tensor<string, []>("input_25_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_25_dilations_0 = const()[name = tensor<string, []>("input_25_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [64, 1, 1, 3]> original_enc_erb_conv3_0_weight_to_fp16 = const()[name = tensor<string, []>("original_enc_erb_conv3_0_weight_to_fp16"), val = tensor<fp16, [64, 1, 1, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19264)))];
            tensor<fp16, [1, 64, 10, 8]> input_25_cast_fp16 = conv(dilations = input_25_dilations_0, groups = input_25_groups_0, pad = input_25_pad_0, pad_type = input_25_pad_type_0, strides = input_25_strides_0, weight = original_enc_erb_conv3_0_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<string, []> input_27_pad_type_0 = const()[name = tensor<string, []>("input_27_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_27_strides_0 = const()[name = tensor<string, []>("input_27_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_27_pad_0 = const()[name = tensor<string, []>("input_27_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_27_dilations_0 = const()[name = tensor<string, []>("input_27_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_27_groups_0 = const()[name = tensor<string, []>("input_27_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 1, 1]> const_33_to_fp16 = const()[name = tensor<string, []>("const_33_to_fp16"), val = tensor<fp16, [64, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19712)))];
            tensor<fp16, [64]> const_34_to_fp16 = const()[name = tensor<string, []>("const_34_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27968)))];
            tensor<fp16, [1, 64, 10, 8]> input_29_cast_fp16 = conv(bias = const_34_to_fp16, dilations = input_27_dilations_0, groups = input_27_groups_0, pad = input_27_pad_0, pad_type = input_27_pad_type_0, strides = input_27_strides_0, weight = const_33_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<fp16, [1, 64, 10, 8]> e3_1_cast_fp16 = relu(x = input_29_cast_fp16)[name = tensor<string, []>("e3_1_cast_fp16")];
            tensor<int32, [8]> input_33_pad_0 = const()[name = tensor<string, []>("input_33_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 2, 0, 0, 0])];
            tensor<string, []> input_33_mode_0 = const()[name = tensor<string, []>("input_33_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp16, []> const_1_to_fp16 = const()[name = tensor<string, []>("const_1_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 2, 10, 96]> input_31_cast_fp16 = transpose(perm = var_589, x = var_584_cast_fp16)[name = tensor<string, []>("transpose_50")];
            tensor<fp16, [1, 2, 12, 96]> input_33_cast_fp16 = pad(constant_val = const_1_to_fp16, mode = input_33_mode_0, pad = input_33_pad_0, x = input_31_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<string, []> input_35_pad_type_0 = const()[name = tensor<string, []>("input_35_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_35_pad_0 = const()[name = tensor<string, []>("input_35_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<int32, []> input_35_groups_0 = const()[name = tensor<string, []>("input_35_groups_0"), val = tensor<int32, []>(2)];
            tensor<int32, [2]> input_35_strides_0 = const()[name = tensor<string, []>("input_35_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_35_dilations_0 = const()[name = tensor<string, []>("input_35_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [64, 1, 3, 3]> original_enc_df_conv0_1_weight_to_fp16 = const()[name = tensor<string, []>("original_enc_df_conv0_1_weight_to_fp16"), val = tensor<fp16, [64, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28160)))];
            tensor<fp16, [1, 64, 10, 96]> input_35_cast_fp16 = conv(dilations = input_35_dilations_0, groups = input_35_groups_0, pad = input_35_pad_0, pad_type = input_35_pad_type_0, strides = input_35_strides_0, weight = original_enc_df_conv0_1_weight_to_fp16, x = input_33_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<string, []> input_37_pad_type_0 = const()[name = tensor<string, []>("input_37_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_37_strides_0 = const()[name = tensor<string, []>("input_37_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_37_pad_0 = const()[name = tensor<string, []>("input_37_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_37_dilations_0 = const()[name = tensor<string, []>("input_37_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_37_groups_0 = const()[name = tensor<string, []>("input_37_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 1, 1]> const_35_to_fp16 = const()[name = tensor<string, []>("const_35_to_fp16"), val = tensor<fp16, [64, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29376)))];
            tensor<fp16, [64]> const_36_to_fp16 = const()[name = tensor<string, []>("const_36_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(37632)))];
            tensor<fp16, [1, 64, 10, 96]> input_39_cast_fp16 = conv(bias = const_36_to_fp16, dilations = input_37_dilations_0, groups = input_37_groups_0, pad = input_37_pad_0, pad_type = input_37_pad_type_0, strides = input_37_strides_0, weight = const_35_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("input_39_cast_fp16")];
            tensor<fp16, [1, 64, 10, 96]> input_41_cast_fp16 = relu(x = input_39_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<string, []> input_43_pad_type_0 = const()[name = tensor<string, []>("input_43_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_43_pad_0 = const()[name = tensor<string, []>("input_43_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<int32, [2]> input_43_strides_0 = const()[name = tensor<string, []>("input_43_strides_0"), val = tensor<int32, [2]>([1, 2])];
            tensor<int32, []> input_43_groups_0 = const()[name = tensor<string, []>("input_43_groups_0"), val = tensor<int32, []>(64)];
            tensor<int32, [2]> input_43_dilations_0 = const()[name = tensor<string, []>("input_43_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [64, 1, 1, 3]> original_enc_df_conv1_0_weight_to_fp16 = const()[name = tensor<string, []>("original_enc_df_conv1_0_weight_to_fp16"), val = tensor<fp16, [64, 1, 1, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(37824)))];
            tensor<fp16, [1, 64, 10, 48]> input_43_cast_fp16 = conv(dilations = input_43_dilations_0, groups = input_43_groups_0, pad = input_43_pad_0, pad_type = input_43_pad_type_0, strides = input_43_strides_0, weight = original_enc_df_conv1_0_weight_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<string, []> input_45_pad_type_0 = const()[name = tensor<string, []>("input_45_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_45_strides_0 = const()[name = tensor<string, []>("input_45_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_45_pad_0 = const()[name = tensor<string, []>("input_45_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_45_dilations_0 = const()[name = tensor<string, []>("input_45_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_45_groups_0 = const()[name = tensor<string, []>("input_45_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 1, 1]> const_37_to_fp16 = const()[name = tensor<string, []>("const_37_to_fp16"), val = tensor<fp16, [64, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(38272)))];
            tensor<fp16, [64]> const_38_to_fp16 = const()[name = tensor<string, []>("const_38_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46528)))];
            tensor<fp16, [1, 64, 10, 48]> input_47_cast_fp16 = conv(bias = const_38_to_fp16, dilations = input_45_dilations_0, groups = input_45_groups_0, pad = input_45_pad_0, pad_type = input_45_pad_type_0, strides = input_45_strides_0, weight = const_37_to_fp16, x = input_43_cast_fp16)[name = tensor<string, []>("input_47_cast_fp16")];
            tensor<fp16, [1, 64, 10, 48]> c1_cast_fp16 = relu(x = input_47_cast_fp16)[name = tensor<string, []>("c1_cast_fp16")];
            tensor<int32, [4]> var_680 = const()[name = tensor<string, []>("op_680"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<int32, [4]> var_685 = const()[name = tensor<string, []>("op_685"), val = tensor<int32, [4]>([1, 10, 32, 96])];
            tensor<fp16, [1, 10, 48, 64]> var_681_cast_fp16 = transpose(perm = var_680, x = c1_cast_fp16)[name = tensor<string, []>("transpose_49")];
            tensor<fp16, [1, 10, 32, 96]> var_686_cast_fp16 = reshape(shape = var_685, x = var_681_cast_fp16)[name = tensor<string, []>("op_686_cast_fp16")];
            tensor<int32, [4]> transpose_0_perm_0 = const()[name = tensor<string, []>("transpose_0_perm_0"), val = tensor<int32, [4]>([2, 0, 1, 3])];
            tensor<int32, [3]> concat_5 = const()[name = tensor<string, []>("concat_5"), val = tensor<int32, [3]>([32, 10, 96])];
            tensor<fp16, [32, 1, 10, 96]> transpose_0_cast_fp16 = transpose(perm = transpose_0_perm_0, x = var_686_cast_fp16)[name = tensor<string, []>("transpose_48")];
            tensor<fp16, [32, 10, 96]> reshape_0_cast_fp16 = reshape(shape = concat_5, x = transpose_0_cast_fp16)[name = tensor<string, []>("reshape_0_cast_fp16")];
            tensor<bool, []> matmul_0_transpose_x_0 = const()[name = tensor<string, []>("matmul_0_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_0_transpose_y_0 = const()[name = tensor<string, []>("matmul_0_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [32, 96, 16]> original_enc_df_fc_emb_0_weight_to_fp16 = const()[name = tensor<string, []>("original_enc_df_fc_emb_0_weight_to_fp16"), val = tensor<fp16, [32, 96, 16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46720)))];
            tensor<fp16, [32, 10, 16]> matmul_0_cast_fp16 = matmul(transpose_x = matmul_0_transpose_x_0, transpose_y = matmul_0_transpose_y_0, x = reshape_0_cast_fp16, y = original_enc_df_fc_emb_0_weight_to_fp16)[name = tensor<string, []>("matmul_0_cast_fp16")];
            tensor<int32, [4]> concat_10 = const()[name = tensor<string, []>("concat_10"), val = tensor<int32, [4]>([32, 1, 10, 16])];
            tensor<fp16, [32, 1, 10, 16]> reshape_2_cast_fp16 = reshape(shape = concat_10, x = matmul_0_cast_fp16)[name = tensor<string, []>("reshape_2_cast_fp16")];
            tensor<int32, [4]> x_3_perm_0 = const()[name = tensor<string, []>("x_3_perm_0"), val = tensor<int32, [4]>([1, 2, 0, 3])];
            tensor<int32, [3]> concat_11 = const()[name = tensor<string, []>("concat_11"), val = tensor<int32, [3]>([1, 10, 512])];
            tensor<fp16, [1, 10, 32, 16]> x_3_cast_fp16 = transpose(perm = x_3_perm_0, x = reshape_2_cast_fp16)[name = tensor<string, []>("transpose_47")];
            tensor<fp16, [1, 10, 512]> input_49_cast_fp16 = reshape(shape = concat_11, x = x_3_cast_fp16)[name = tensor<string, []>("input_49_cast_fp16")];
            tensor<fp16, [1, 10, 512]> b_3_cast_fp16 = relu(x = input_49_cast_fp16)[name = tensor<string, []>("b_3_cast_fp16")];
            tensor<int32, [4]> var_691 = const()[name = tensor<string, []>("op_691"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<int32, [3]> concat_12 = const()[name = tensor<string, []>("concat_12"), val = tensor<int32, [3]>([1, 10, 512])];
            tensor<fp16, [1, 10, 8, 64]> var_692_cast_fp16 = transpose(perm = var_691, x = e3_1_cast_fp16)[name = tensor<string, []>("transpose_46")];
            tensor<fp16, [1, 10, 512]> a_cast_fp16 = reshape(shape = concat_12, x = var_692_cast_fp16)[name = tensor<string, []>("a_cast_fp16")];
            tensor<fp16, [1, 10, 512]> emb_cast_fp16 = add(x = a_cast_fp16, y = b_3_cast_fp16)[name = tensor<string, []>("emb_cast_fp16")];
            tensor<int32, [3]> var_696_begin_0 = const()[name = tensor<string, []>("op_696_begin_0"), val = tensor<int32, [3]>([0, -1, 0])];
            tensor<int32, [3]> var_696_end_0 = const()[name = tensor<string, []>("op_696_end_0"), val = tensor<int32, [3]>([1, 10, 512])];
            tensor<bool, [3]> var_696_end_mask_0 = const()[name = tensor<string, []>("op_696_end_mask_0"), val = tensor<bool, [3]>([true, true, true])];
            tensor<fp16, [1, 1, 512]> var_696_cast_fp16 = slice_by_index(begin = var_696_begin_0, end = var_696_end_0, end_mask = var_696_end_mask_0, x = emb_cast_fp16)[name = tensor<string, []>("op_696_cast_fp16")];
            tensor<int32, [3]> var_698 = const()[name = tensor<string, []>("op_698"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<int32, [4]> var_703 = const()[name = tensor<string, []>("op_703"), val = tensor<int32, [4]>([1, 1, 16, 32])];
            tensor<fp16, [1, 1, 16, 32]> var_704_cast_fp16 = reshape(shape = var_703, x = var_696_cast_fp16)[name = tensor<string, []>("op_704_cast_fp16")];
            tensor<int32, [4]> transpose_2_perm_0 = const()[name = tensor<string, []>("transpose_2_perm_0"), val = tensor<int32, [4]>([2, 0, 1, 3])];
            tensor<int32, [3]> concat_17 = const()[name = tensor<string, []>("concat_17"), val = tensor<int32, [3]>([16, 1, 32])];
            tensor<fp16, [16, 1, 1, 32]> transpose_2_cast_fp16 = transpose(perm = transpose_2_perm_0, x = var_704_cast_fp16)[name = tensor<string, []>("transpose_44")];
            tensor<fp16, [16, 1, 32]> reshape_3_cast_fp16 = reshape(shape = concat_17, x = transpose_2_cast_fp16)[name = tensor<string, []>("reshape_3_cast_fp16")];
            tensor<bool, []> matmul_1_transpose_x_0 = const()[name = tensor<string, []>("matmul_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_1_transpose_y_0 = const()[name = tensor<string, []>("matmul_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 32, 16]> original_enc_emb_gru_linear_in_0_weight_to_fp16 = const()[name = tensor<string, []>("original_enc_emb_gru_linear_in_0_weight_to_fp16"), val = tensor<fp16, [16, 32, 16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(145088)))];
            tensor<fp16, [16, 1, 16]> matmul_1_cast_fp16 = matmul(transpose_x = matmul_1_transpose_x_0, transpose_y = matmul_1_transpose_y_0, x = reshape_3_cast_fp16, y = original_enc_emb_gru_linear_in_0_weight_to_fp16)[name = tensor<string, []>("matmul_1_cast_fp16")];
            tensor<int32, [4]> concat_22 = const()[name = tensor<string, []>("concat_22"), val = tensor<int32, [4]>([16, 1, 1, 16])];
            tensor<fp16, [16, 1, 1, 16]> reshape_5_cast_fp16 = reshape(shape = concat_22, x = matmul_1_cast_fp16)[name = tensor<string, []>("reshape_5_cast_fp16")];
            tensor<int32, [4]> x_7_perm_0 = const()[name = tensor<string, []>("x_7_perm_0"), val = tensor<int32, [4]>([1, 2, 0, 3])];
            tensor<int32, [3]> concat_23 = const()[name = tensor<string, []>("concat_23"), val = tensor<int32, [3]>([1, 1, 256])];
            tensor<fp16, [1, 1, 16, 16]> x_7_cast_fp16 = transpose(perm = x_7_perm_0, x = reshape_5_cast_fp16)[name = tensor<string, []>("transpose_43")];
            tensor<fp16, [1, 1, 256]> input_51_cast_fp16 = reshape(shape = concat_23, x = x_7_cast_fp16)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<fp16, [1, 1, 256]> input_53_cast_fp16 = relu(x = input_51_cast_fp16)[name = tensor<string, []>("input_53_cast_fp16")];
            tensor<int32, [3]> transpose_4_perm_0 = const()[name = tensor<string, []>("transpose_4_perm_0"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<int32, [1]> slice_by_index_23 = const()[name = tensor<string, []>("slice_by_index_23"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> concat_25_axis_0 = const()[name = tensor<string, []>("concat_25_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_25_interleave_0 = const()[name = tensor<string, []>("concat_25_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 1, 256]> fill_0_to_fp16 = const()[name = tensor<string, []>("fill_0_to_fp16"), val = tensor<fp16, [1, 1, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(161536)))];
            tensor<fp16, [1, 1, 256]> var_699_cast_fp16 = transpose(perm = var_698, x = h_enc_in)[name = tensor<string, []>("transpose_45")];
            tensor<fp16, [2, 1, 256]> concat_25_cast_fp16 = concat(axis = concat_25_axis_0, interleave = concat_25_interleave_0, values = (var_699_cast_fp16, fill_0_to_fp16))[name = tensor<string, []>("concat_25_cast_fp16")];
            tensor<string, []> concat_25_cast_fp16_to_fp32_dtype_0 = const()[name = tensor<string, []>("concat_25_cast_fp16_to_fp32_dtype_0"), val = tensor<string, []>("fp32")];
            tensor<int32, [1]> while_loop_0_loop_vars0_0 = const()[name = tensor<string, []>("while_loop_0_loop_vars0_0"), val = tensor<int32, [1]>([0])];
            tensor<fp32, [2, 1, 256]> concat_25_cast_fp16_to_fp32 = cast(dtype = concat_25_cast_fp16_to_fp32_dtype_0, x = concat_25_cast_fp16)[name = tensor<string, []>("cast_52")];
            tensor<fp16, [1, 1, 256]> transpose_4_cast_fp16 = transpose(perm = transpose_4_perm_0, x = input_53_cast_fp16)[name = tensor<string, []>("transpose_42")];
            tensor<int32, [1]> while_loop_0_0, tensor<fp32, [2, 1, 256]> while_loop_0_1 = while_loop(loop_vars = (while_loop_0_loop_vars0_0, concat_25_cast_fp16_to_fp32))[name = tensor<string, []>("while_loop_0")]
                (tensor<int32, [1]> while_loop_0_loop_vars0_0_x0_1_1_1_0, tensor<fp32, [2, 1, 256]> concat_25_x0_1_1_1_0) {
                    tensor<bool, [1]> less_1 = less(x = while_loop_0_loop_vars0_0_x0_1_1_1_0, y = slice_by_index_23)[name = tensor<string, []>("less_1")];
                } -> (less_1)
                (tensor<int32, [1]> while_loop_0_loop_vars0_0_x0_1_1_1_1, tensor<fp32, [2, 1, 256]> concat_25_x0_1_1_1_1) {
                    tensor<int32, []> gather_2_axis_0 = const()[name = tensor<string, []>("gather_2_axis_0"), val = tensor<int32, []>(0)];
                    tensor<int32, []> gather_2_batch_dims_0 = const()[name = tensor<string, []>("gather_2_batch_dims_0"), val = tensor<int32, []>(0)];
                    tensor<fp16, [1, 1, 256]> gather_2_cast_fp16 = gather(axis = gather_2_axis_0, batch_dims = gather_2_batch_dims_0, indices = while_loop_0_loop_vars0_0_x0_1_1_1_1, x = transpose_4_cast_fp16)[name = tensor<string, []>("gather_2_cast_fp16")];
                    tensor<int32, []> gather_3_axis_0 = const()[name = tensor<string, []>("gather_3_axis_0"), val = tensor<int32, []>(0)];
                    tensor<int32, []> gather_3_batch_dims_0 = const()[name = tensor<string, []>("gather_3_batch_dims_0"), val = tensor<int32, []>(0)];
                    tensor<string, []> concat_25_x0_1_to_fp16_dtype_0 = const()[name = tensor<string, []>("concat_25_x0_1_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
                    tensor<fp16, [2, 1, 256]> concat_25_x0_1_to_fp16 = cast(dtype = concat_25_x0_1_to_fp16_dtype_0, x = concat_25_x0_1_1_1_1)[name = tensor<string, []>("cast_51")];
                    tensor<fp16, [1, 1, 256]> gather_3_cast_fp16 = gather(axis = gather_3_axis_0, batch_dims = gather_3_batch_dims_0, indices = while_loop_0_loop_vars0_0_x0_1_1_1_1, x = concat_25_x0_1_to_fp16)[name = tensor<string, []>("gather_3_cast_fp16")];
                    tensor<int32, [1]> squeeze_2_axes_0 = const()[name = tensor<string, []>("squeeze_2_axes_0"), val = tensor<int32, [1]>([0])];
                    tensor<fp16, [1, 256]> squeeze_2_cast_fp16 = squeeze(axes = squeeze_2_axes_0, x = gather_2_cast_fp16)[name = tensor<string, []>("squeeze_2_cast_fp16")];
                    tensor<int32, [1]> squeeze_3_axes_0 = const()[name = tensor<string, []>("squeeze_3_axes_0"), val = tensor<int32, [1]>([0])];
                    tensor<fp16, [1, 256]> squeeze_3_cast_fp16 = squeeze(axes = squeeze_3_axes_0, x = gather_3_cast_fp16)[name = tensor<string, []>("squeeze_3_cast_fp16")];
                    tensor<fp16, [256, 256]> linear_6_weight_0_to_fp16 = const()[name = tensor<string, []>("linear_6_weight_0_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(162112)))];
                    tensor<fp16, [256]> linear_6_bias_0_to_fp16 = const()[name = tensor<string, []>("linear_6_bias_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(293248)))];
                    tensor<fp16, [1, 256]> linear_6_cast_fp16 = linear(bias = linear_6_bias_0_to_fp16, weight = linear_6_weight_0_to_fp16, x = squeeze_2_cast_fp16)[name = tensor<string, []>("linear_6_cast_fp16")];
                    tensor<fp16, [256, 256]> linear_7_weight_0_to_fp16 = const()[name = tensor<string, []>("linear_7_weight_0_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(293824)))];
                    tensor<fp16, [256]> linear_7_bias_0_to_fp16 = const()[name = tensor<string, []>("linear_7_bias_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(424960)))];
                    tensor<fp16, [1, 256]> linear_7_cast_fp16 = linear(bias = linear_7_bias_0_to_fp16, weight = linear_7_weight_0_to_fp16, x = squeeze_3_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
                    tensor<fp16, [1, 256]> add_5_cast_fp16 = add(x = linear_6_cast_fp16, y = linear_7_cast_fp16)[name = tensor<string, []>("add_5_cast_fp16")];
                    tensor<fp16, [1, 256]> sigmoid_2_cast_fp16 = sigmoid(x = add_5_cast_fp16)[name = tensor<string, []>("sigmoid_2_cast_fp16")];
                    tensor<fp16, [256, 256]> linear_8_weight_0_to_fp16 = const()[name = tensor<string, []>("linear_8_weight_0_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(425536)))];
                    tensor<fp16, [256]> linear_8_bias_0_to_fp16 = const()[name = tensor<string, []>("linear_8_bias_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(556672)))];
                    tensor<fp16, [1, 256]> linear_8_cast_fp16 = linear(bias = linear_8_bias_0_to_fp16, weight = linear_8_weight_0_to_fp16, x = squeeze_2_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
                    tensor<fp16, [256, 256]> linear_9_weight_0_to_fp16 = const()[name = tensor<string, []>("linear_9_weight_0_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(557248)))];
                    tensor<fp16, [256]> linear_9_bias_0_to_fp16 = const()[name = tensor<string, []>("linear_9_bias_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(688384)))];
                    tensor<fp16, [1, 256]> linear_9_cast_fp16 = linear(bias = linear_9_bias_0_to_fp16, weight = linear_9_weight_0_to_fp16, x = squeeze_3_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
                    tensor<fp16, [1, 256]> add_6_cast_fp16 = add(x = linear_8_cast_fp16, y = linear_9_cast_fp16)[name = tensor<string, []>("add_6_cast_fp16")];
                    tensor<fp16, [1, 256]> sigmoid_3_cast_fp16 = sigmoid(x = add_6_cast_fp16)[name = tensor<string, []>("sigmoid_3_cast_fp16")];
                    tensor<fp16, [256, 256]> linear_10_weight_0_to_fp16 = const()[name = tensor<string, []>("linear_10_weight_0_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(688960)))];
                    tensor<fp16, [256]> linear_10_bias_0_to_fp16 = const()[name = tensor<string, []>("linear_10_bias_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(820096)))];
                    tensor<fp16, [1, 256]> linear_10_cast_fp16 = linear(bias = linear_10_bias_0_to_fp16, weight = linear_10_weight_0_to_fp16, x = squeeze_2_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
                    tensor<fp16, [256, 256]> linear_11_weight_0_to_fp16 = const()[name = tensor<string, []>("linear_11_weight_0_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(820672)))];
                    tensor<fp16, [256]> linear_11_bias_0_to_fp16 = const()[name = tensor<string, []>("linear_11_bias_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(951808)))];
                    tensor<fp16, [1, 256]> linear_11_cast_fp16 = linear(bias = linear_11_bias_0_to_fp16, weight = linear_11_weight_0_to_fp16, x = squeeze_3_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
                    tensor<fp16, [1, 256]> mul_3_cast_fp16 = mul(x = sigmoid_2_cast_fp16, y = linear_11_cast_fp16)[name = tensor<string, []>("mul_3_cast_fp16")];
                    tensor<fp16, [1, 256]> add_7_cast_fp16 = add(x = linear_10_cast_fp16, y = mul_3_cast_fp16)[name = tensor<string, []>("add_7_cast_fp16")];
                    tensor<fp16, [1, 256]> tanh_1_cast_fp16 = tanh(x = add_7_cast_fp16)[name = tensor<string, []>("tanh_1_cast_fp16")];
                    tensor<fp16, []> sub_1_x_0_to_fp16 = const()[name = tensor<string, []>("sub_1_x_0_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
                    tensor<fp16, [1, 256]> sub_1_cast_fp16 = sub(x = sub_1_x_0_to_fp16, y = sigmoid_3_cast_fp16)[name = tensor<string, []>("sub_1_cast_fp16")];
                    tensor<fp16, [1, 256]> mul_4_cast_fp16 = mul(x = sub_1_cast_fp16, y = tanh_1_cast_fp16)[name = tensor<string, []>("mul_4_cast_fp16")];
                    tensor<fp16, [1, 256]> mul_5_cast_fp16 = mul(x = sigmoid_3_cast_fp16, y = squeeze_3_cast_fp16)[name = tensor<string, []>("mul_5_cast_fp16")];
                    tensor<fp16, [1, 256]> add_8_cast_fp16 = add(x = mul_4_cast_fp16, y = mul_5_cast_fp16)[name = tensor<string, []>("add_8_cast_fp16")];
                    tensor<int32, []> add_9_y_0 = const()[name = tensor<string, []>("add_9_y_0"), val = tensor<int32, []>(1)];
                    tensor<int32, [1]> add_9 = add(x = while_loop_0_loop_vars0_0_x0_1_1_1_1, y = add_9_y_0)[name = tensor<string, []>("add_9")];
                    tensor<int32, [1]> expand_dims_1_axes_0 = const()[name = tensor<string, []>("expand_dims_1_axes_0"), val = tensor<int32, [1]>([0])];
                    tensor<fp16, [1, 1, 256]> expand_dims_1_cast_fp16 = expand_dims(axes = expand_dims_1_axes_0, x = add_8_cast_fp16)[name = tensor<string, []>("expand_dims_1_cast_fp16")];
                    tensor<int32, []> scatter_1_axis_0 = const()[name = tensor<string, []>("scatter_1_axis_0"), val = tensor<int32, []>(0)];
                    tensor<string, []> scatter_1_mode_0 = const()[name = tensor<string, []>("scatter_1_mode_0"), val = tensor<string, []>("add")];
                    tensor<fp16, [2, 1, 256]> scatter_1_cast_fp16 = scatter(axis = scatter_1_axis_0, data = concat_25_x0_1_to_fp16, indices = add_9, mode = scatter_1_mode_0, updates = expand_dims_1_cast_fp16)[name = tensor<string, []>("scatter_1_cast_fp16")];
                    tensor<string, []> scatter_1_cast_fp16_to_fp32_dtype_0 = const()[name = tensor<string, []>("scatter_1_cast_fp16_to_fp32_dtype_0"), val = tensor<string, []>("fp32")];
                    tensor<fp32, [2, 1, 256]> scatter_1_cast_fp16_to_fp32 = cast(dtype = scatter_1_cast_fp16_to_fp32_dtype_0, x = scatter_1_cast_fp16)[name = tensor<string, []>("cast_50")];
                } -> (add_9, scatter_1_cast_fp16_to_fp32);
            tensor<int32, [3]> x_9_tmp_begin_0 = const()[name = tensor<string, []>("x_9_tmp_begin_0"), val = tensor<int32, [3]>([1, 0, 0])];
            tensor<int32, [3]> x_9_tmp_end_0 = const()[name = tensor<string, []>("x_9_tmp_end_0"), val = tensor<int32, [3]>([0, 0, 0])];
            tensor<bool, [3]> x_9_tmp_begin_mask_0 = const()[name = tensor<string, []>("x_9_tmp_begin_mask_0"), val = tensor<bool, [3]>([false, true, true])];
            tensor<bool, [3]> x_9_tmp_end_mask_0 = const()[name = tensor<string, []>("x_9_tmp_end_mask_0"), val = tensor<bool, [3]>([true, true, true])];
            tensor<string, []> while_loop_0_1_to_fp16_dtype_0 = const()[name = tensor<string, []>("while_loop_0_1_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [2, 1, 256]> while_loop_0_1_to_fp16 = cast(dtype = while_loop_0_1_to_fp16_dtype_0, x = while_loop_0_1)[name = tensor<string, []>("cast_49")];
            tensor<fp16, [1, 1, 256]> x_9_tmp_cast_fp16 = slice_by_index(begin = x_9_tmp_begin_0, begin_mask = x_9_tmp_begin_mask_0, end = x_9_tmp_end_0, end_mask = x_9_tmp_end_mask_0, x = while_loop_0_1_to_fp16)[name = tensor<string, []>("x_9_tmp_cast_fp16")];
            tensor<int32, [3]> x_9_perm_0 = const()[name = tensor<string, []>("x_9_perm_0"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<int32, [4]> var_717 = const()[name = tensor<string, []>("op_717"), val = tensor<int32, [4]>([1, 1, 16, 16])];
            tensor<fp16, [1, 1, 256]> h_enc_out = transpose(perm = x_9_perm_0, x = x_9_tmp_cast_fp16)[name = tensor<string, []>("transpose_41")];
            tensor<fp16, [1, 1, 16, 16]> var_718_cast_fp16 = reshape(shape = var_717, x = h_enc_out)[name = tensor<string, []>("op_718_cast_fp16")];
            tensor<int32, [4]> transpose_5_perm_0 = const()[name = tensor<string, []>("transpose_5_perm_0"), val = tensor<int32, [4]>([2, 0, 1, 3])];
            tensor<int32, [3]> concat_30 = const()[name = tensor<string, []>("concat_30"), val = tensor<int32, [3]>([16, 1, 16])];
            tensor<fp16, [16, 1, 1, 16]> transpose_5_cast_fp16 = transpose(perm = transpose_5_perm_0, x = var_718_cast_fp16)[name = tensor<string, []>("transpose_40")];
            tensor<fp16, [16, 1, 16]> reshape_6_cast_fp16 = reshape(shape = concat_30, x = transpose_5_cast_fp16)[name = tensor<string, []>("reshape_6_cast_fp16")];
            tensor<bool, []> matmul_2_transpose_x_0 = const()[name = tensor<string, []>("matmul_2_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_2_transpose_y_0 = const()[name = tensor<string, []>("matmul_2_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 16, 32]> original_enc_emb_gru_linear_out_0_weight_to_fp16 = const()[name = tensor<string, []>("original_enc_emb_gru_linear_out_0_weight_to_fp16"), val = tensor<fp16, [16, 16, 32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(952384)))];
            tensor<fp16, [16, 1, 32]> matmul_2_cast_fp16 = matmul(transpose_x = matmul_2_transpose_x_0, transpose_y = matmul_2_transpose_y_0, x = reshape_6_cast_fp16, y = original_enc_emb_gru_linear_out_0_weight_to_fp16)[name = tensor<string, []>("matmul_2_cast_fp16")];
            tensor<int32, [4]> concat_35 = const()[name = tensor<string, []>("concat_35"), val = tensor<int32, [4]>([16, 1, 1, 32])];
            tensor<fp16, [16, 1, 1, 32]> reshape_8_cast_fp16 = reshape(shape = concat_35, x = matmul_2_cast_fp16)[name = tensor<string, []>("reshape_8_cast_fp16")];
            tensor<int32, [4]> x_11_perm_0 = const()[name = tensor<string, []>("x_11_perm_0"), val = tensor<int32, [4]>([1, 2, 0, 3])];
            tensor<int32, [3]> concat_36 = const()[name = tensor<string, []>("concat_36"), val = tensor<int32, [3]>([1, 1, 512])];
            tensor<fp16, [1, 1, 16, 32]> x_11_cast_fp16 = transpose(perm = x_11_perm_0, x = reshape_8_cast_fp16)[name = tensor<string, []>("transpose_39")];
            tensor<fp16, [1, 1, 512]> input_55_cast_fp16 = reshape(shape = concat_36, x = x_11_cast_fp16)[name = tensor<string, []>("input_55_cast_fp16")];
            tensor<fp16, [1, 1, 512]> input_57_cast_fp16 = relu(x = input_55_cast_fp16)[name = tensor<string, []>("input_57_cast_fp16")];
            tensor<fp16, [1, 512]> original_enc_lsnr_fc_0_weight_to_fp16 = const()[name = tensor<string, []>("original_enc_lsnr_fc_0_weight_to_fp16"), val = tensor<fp16, [1, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(968832)))];
            tensor<fp16, [1]> original_enc_lsnr_fc_0_bias_to_fp16 = const()[name = tensor<string, []>("original_enc_lsnr_fc_0_bias_to_fp16"), val = tensor<fp16, [1]>([-0x1.33p-2])];
            tensor<fp16, [1, 1, 1]> linear_12_cast_fp16 = linear(bias = original_enc_lsnr_fc_0_bias_to_fp16, weight = original_enc_lsnr_fc_0_weight_to_fp16, x = input_57_cast_fp16)[name = tensor<string, []>("linear_12_cast_fp16")];
            tensor<fp16, [1, 1, 1]> var_729_cast_fp16 = sigmoid(x = linear_12_cast_fp16)[name = tensor<string, []>("op_729_cast_fp16")];
            tensor<fp16, []> var_730_promoted_to_fp16 = const()[name = tensor<string, []>("op_730_promoted_to_fp16"), val = tensor<fp16, []>(0x1.9p+5)];
            tensor<fp16, [1, 1, 1]> var_731_cast_fp16 = mul(x = var_729_cast_fp16, y = var_730_promoted_to_fp16)[name = tensor<string, []>("op_731_cast_fp16")];
            tensor<fp16, []> var_732_promoted_to_fp16 = const()[name = tensor<string, []>("op_732_promoted_to_fp16"), val = tensor<fp16, []>(-0x1.ep+3)];
            tensor<fp16, [1, 1, 1]> lsnr = add(x = var_731_cast_fp16, y = var_732_promoted_to_fp16)[name = tensor<string, []>("op_733_cast_fp16")];
            tensor<int32, [4]> var_736_begin_0 = const()[name = tensor<string, []>("op_736_begin_0"), val = tensor<int32, [4]>([0, 0, -1, 0])];
            tensor<int32, [4]> var_736_end_0 = const()[name = tensor<string, []>("op_736_end_0"), val = tensor<int32, [4]>([1, 64, 10, 32])];
            tensor<bool, [4]> var_736_end_mask_0 = const()[name = tensor<string, []>("op_736_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 64, 1, 32]> var_736_cast_fp16 = slice_by_index(begin = var_736_begin_0, end = var_736_end_0, end_mask = var_736_end_mask_0, x = input_7_cast_fp16)[name = tensor<string, []>("op_736_cast_fp16")];
            tensor<int32, [4]> var_740_begin_0 = const()[name = tensor<string, []>("op_740_begin_0"), val = tensor<int32, [4]>([0, 0, -1, 0])];
            tensor<int32, [4]> var_740_end_0 = const()[name = tensor<string, []>("op_740_end_0"), val = tensor<int32, [4]>([1, 64, 10, 16])];
            tensor<bool, [4]> var_740_end_mask_0 = const()[name = tensor<string, []>("op_740_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 64, 1, 16]> var_740_cast_fp16 = slice_by_index(begin = var_740_begin_0, end = var_740_end_0, end_mask = var_740_end_mask_0, x = input_15_cast_fp16)[name = tensor<string, []>("op_740_cast_fp16")];
            tensor<int32, [4]> var_744_begin_0 = const()[name = tensor<string, []>("op_744_begin_0"), val = tensor<int32, [4]>([0, 0, -1, 0])];
            tensor<int32, [4]> var_744_end_0 = const()[name = tensor<string, []>("op_744_end_0"), val = tensor<int32, [4]>([1, 64, 10, 8])];
            tensor<bool, [4]> var_744_end_mask_0 = const()[name = tensor<string, []>("op_744_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 64, 1, 8]> var_744_cast_fp16 = slice_by_index(begin = var_744_begin_0, end = var_744_end_0, end_mask = var_744_end_mask_0, x = input_23_cast_fp16)[name = tensor<string, []>("op_744_cast_fp16")];
            tensor<int32, [4]> var_748_begin_0 = const()[name = tensor<string, []>("op_748_begin_0"), val = tensor<int32, [4]>([0, 0, -1, 0])];
            tensor<int32, [4]> var_748_end_0 = const()[name = tensor<string, []>("op_748_end_0"), val = tensor<int32, [4]>([1, 64, 10, 8])];
            tensor<bool, [4]> var_748_end_mask_0 = const()[name = tensor<string, []>("op_748_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 64, 1, 8]> var_748_cast_fp16 = slice_by_index(begin = var_748_begin_0, end = var_748_end_0, end_mask = var_748_end_mask_0, x = e3_1_cast_fp16)[name = tensor<string, []>("op_748_cast_fp16")];
            tensor<int32, [3]> var_774 = const()[name = tensor<string, []>("op_774"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<int32, [4]> var_779 = const()[name = tensor<string, []>("op_779"), val = tensor<int32, [4]>([1, 1, 16, 32])];
            tensor<fp16, [1, 1, 16, 32]> var_780_cast_fp16 = reshape(shape = var_779, x = input_57_cast_fp16)[name = tensor<string, []>("op_780_cast_fp16")];
            tensor<int32, [4]> transpose_7_perm_0 = const()[name = tensor<string, []>("transpose_7_perm_0"), val = tensor<int32, [4]>([2, 0, 1, 3])];
            tensor<int32, [3]> concat_41 = const()[name = tensor<string, []>("concat_41"), val = tensor<int32, [3]>([16, 1, 32])];
            tensor<fp16, [16, 1, 1, 32]> transpose_7_cast_fp16 = transpose(perm = transpose_7_perm_0, x = var_780_cast_fp16)[name = tensor<string, []>("transpose_37")];
            tensor<fp16, [16, 1, 32]> reshape_9_cast_fp16 = reshape(shape = concat_41, x = transpose_7_cast_fp16)[name = tensor<string, []>("reshape_9_cast_fp16")];
            tensor<bool, []> matmul_3_transpose_x_0 = const()[name = tensor<string, []>("matmul_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_3_transpose_y_0 = const()[name = tensor<string, []>("matmul_3_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 32, 16]> original_erb_dec_emb_gru_linear_in_0_weight_to_fp16 = const()[name = tensor<string, []>("original_erb_dec_emb_gru_linear_in_0_weight_to_fp16"), val = tensor<fp16, [16, 32, 16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(969920)))];
            tensor<fp16, [16, 1, 16]> matmul_3_cast_fp16 = matmul(transpose_x = matmul_3_transpose_x_0, transpose_y = matmul_3_transpose_y_0, x = reshape_9_cast_fp16, y = original_erb_dec_emb_gru_linear_in_0_weight_to_fp16)[name = tensor<string, []>("matmul_3_cast_fp16")];
            tensor<int32, [4]> concat_46 = const()[name = tensor<string, []>("concat_46"), val = tensor<int32, [4]>([16, 1, 1, 16])];
            tensor<fp16, [16, 1, 1, 16]> reshape_11_cast_fp16 = reshape(shape = concat_46, x = matmul_3_cast_fp16)[name = tensor<string, []>("reshape_11_cast_fp16")];
            tensor<int32, [4]> x_13_perm_0 = const()[name = tensor<string, []>("x_13_perm_0"), val = tensor<int32, [4]>([1, 2, 0, 3])];
